# Рефлексия


# 10. Множество.

# 4. Метод, реализующий декартово произведение множеств.

# Решение идентично.

# 6. Реализуйте мульти-множество (Bag), в котором каждый элемент может присутствовать несколько раз.

# Решение аналогично.

# Наелся с открытой адресацией).


# 11. Фильтр Блюма.

# 2. Алгоритм слияния нескольких фильтров Блюма.

# Решение аналогично.

# 3. Фильтр Блюма, предусматривающий удаление элементов.

#  Решение аналогично.

# 4. Алгоритм, который анализирует конфигурацию фильтра Блюма и пытается, насколько возможно, восстановить исходное множество с учётом всех ограничений и искажений (например, коллизий, ложноположительных срабатываний...).

# Идея понятна. Либо брут-форсом пытаемся получить результаты из фильтра, либо используем дополнительную информацию о входных данных.